In [ ]:
# 05 MEMBALIK URUTAN BARIS DAN KOLOM PADA DATA FRAME

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.1.3
1.19.2

In [4]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size = (n_rows, n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  7  4  5  2  1
1  6  9  3  1  7
2  7  9  1  4  9
3  6  3  9  7  3
4  6  3  4  8  2

In [5]:
#Membalik urutan kolomnya
# : pada isi bagian satu bertugas mengatur baris
# : pada isi bagian dua bertugas mengatur kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  1  2  5  4  7
1  7  1  3  9  6
2  9  4  1  9  7
3  3  7  9  3  6
4  2  8  4  3  6

In [6]:
#Membalik urutan barisnya
df.loc[::-1]

   A  B  C  D  E
4  6  3  4  8  2
3  6  3  9  7  3
2  7  9  1  4  9
1  6  9  3  1  7
0  7  4  5  2  1

In [9]:
#Membalik urutan baris dan melakukan penyesuaian ulang index
#Artinya urutan indexnya tetap 0 diatas 4 dibawah tetapi isinya baris tetap terbalik
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  6  3  4  8  2
1  6  3  9  7  3
2  7  9  1  4  9
3  6  9  3  1  7
4  7  4  5  2  1

In [ ]:
# 06 MENGGANTI NAMA (LABEL) KOLOM PADA DATA FRAME

In [10]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')# Nama label adalah 'ABCDE'

df = pd.DataFrame(np.random.randint(1,10, size = (n_rows, n_cols)),
                 columns = cols)
df

   A  B  C  D  E
0  2  2  8  9  3
1  6  9  4  8  9
2  3  8  4  1  4
3  5  9  1  2  5
4  6  6  6  3  2

In [11]:
df.rename(columns={'C':'Hobi'})
#Nama kolom C nya mau diubah menjadi kolom Hobi

   A  B  Hobi  D  E
0  2  2     8  9  3
1  6  9     4  8  9
2  3  8     4  1  4
3  5  9     1  2  5
4  6  6     6  3  2

In [12]:
#Mengganti nama (label) untuk BANYAK kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     2       2  8     9  3
1     6       9  4     8  9
2     3       8  4     1  4
3     5       9  1     2  5
4     6       6  6     3  2

In [ ]:
# 07 MENGHAPUS (drop) MISSING VALUES (NaN)

In [16]:
import pandas as pd
print(pd.__version__)

1.1.3

In [21]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  1UqTUEFa2m -1.290843 -0.103338 -0.813956 -0.962606
1  AVRmkA5PU1 -0.582857  2.130541 -1.496993  1.015965
2  FUvijNbtSz -0.471462 -0.054615       NaN  0.482526
3  qhSBdAHqVA  2.208560  0.188474  1.017329  0.303041
4  lnTmgIOjHU  1.018426  0.340768       NaN  0.424396

In [22]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  1UqTUEFa2m -1.290843 -0.103338 -0.813956 -0.962606
1  AVRmkA5PU1 -0.582857  2.130541 -1.496993  1.015965
2  FUvijNbtSz -0.471462 -0.054615       NaN  0.482526
3  qhSBdAHqVA  2.208560  0.188474  1.017329  0.303041
4  lnTmgIOjHU  1.018426  0.340768       NaN  0.424396

In [23]:
df_backup = df.copy(deep=True)

In [24]:
#Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  1UqTUEFa2m
1  AVRmkA5PU1
2  FUvijNbtSz
3  qhSBdAHqVA
4  lnTmgIOjHU

In [25]:
#Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  1UqTUEFa2m -1.290843 -0.103338 -0.813956 -0.962606
1  AVRmkA5PU1 -0.582857  2.130541 -1.496993  1.015965
3  qhSBdAHqVA  2.208560  0.188474  1.017329  0.303041
5  1Wol8u9I4f -0.548038 -0.464307 -1.258661 -0.092543
6  PwSLqgcynI -0.571148  1.766422  0.229894 -0.007519

In [35]:
#Cara mengetahui persentase missing values untuk setiap kolom
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.033333
B    0.100000
C    0.133333
D    0.133333
dtype: float64

In [36]:
#Menghapus (drop) setiap kolom yang mengandung missing values berdasarkan threshold
treshold = len(df) * 0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         B
0  1UqTUEFa2m -1.290843 -0.103338
1  AVRmkA5PU1 -0.582857  2.130541
2  FUvijNbtSz -0.471462 -0.054615
3  qhSBdAHqVA  2.208560  0.188474
4  lnTmgIOjHU  1.018426  0.340768

In [ ]:
# 08 MEMERIKSA KESAMAAN ANTAR DUA BUAH KOLOM (SERIES) PADA DATA FRAME

In [37]:
data = {'A':[15, 15, 18, np.nan, 12],
       'B':[15, 15, 18, np.nan, 12]}

df = pd.DataFrame(data)
df
#Persiapan data frame

      A     B
0  15.0  15.0
1  15.0  15.0
2  18.0  18.0
3   NaN   NaN
4  12.0  12.0

In [ ]:
# MENGENAL PANDAS SERIES
# Merupakan struktur data lain yang dimiliki pandas
# Data frame terdiri dari sejumlah series, dikolom atas memiliki 2 series yaitu A dan B

In [38]:
df['A']

0    15.0
1    15.0
2    18.0
3     NaN
4    12.0
Name: A, dtype: float64

In [39]:
type(df['A'])

pandas.core.series.Series

In [40]:
type(df)

pandas.core.frame.DataFrame

In [41]:
#Memeriksa kesamaan dengan operator ==
#Jika ingin membandingkan tampilan 2 kolom atau 2 buah series sebaiknya ga menggunakan operator ==
df['A'] == df['B']

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [42]:
#Memeriksa kesamaan dengan method equals()
#Membandingkan series lebih baik dengan equals()
df['A'].equals(df['B'])

True

In [44]:
#Memeriksa kesamaan antar dua data frame
df1 = df.copy(deep=True)

df.equals(df1)

True

In [45]:
df == df1

       A      B
0   True   True
1   True   True
2   True   True
3  False  False
4   True   True